src/cfe/КСП/Documents/КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов</Name>
			<BasedOn>
				<xr:Item>Document.КСП_ЧекЛистПроверкиКачестваПряжи</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КСП_ПроверкаКачестваТестовыхОтвязовПоЧекЛистам</xr:Item>
				<xr:Item>InformationRegister.КСП_ПаспортКачества</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КСП_ЧекЛистПроверкиКачестваПряжи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаЗавершенияПретензионнойРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПотребности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбразецОтвязаПереданКонфекционеру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоЛотам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДляТестовогоОтвяза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБрака</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзмененияНормыВремениВязания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзмененияНормыВремениПошива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзмененияНормыРасходаПряжи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СогласованиеОтклонения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверкаЗавершена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗавершенияПроверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПотерьНаВходномКонтроле</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПотерьНаВходномКонтроле</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрольКачества</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПунктПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КСП_ПунктыПроверкиКачестваПоЧекЛистам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норматив</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиДляСвязиСФото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФотоДефектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтрокиДляСвязиСФото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТехХарактеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПутьКФайлу</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/Documents/КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПредварительныйПросмотр(Команда)
	Элементы.ТехХарактеристикиПредварительныйПросмотр.Пометка = Не Элементы.ТехХарактеристикиПредварительныйПросмотр.Пометка;
	Элементы.ПредпросмотрФайла.Видимость = Элементы.ТехХарактеристикиПредварительныйПросмотр.Пометка;
	ТехХарактеристикиПутьКФайлуПриИзменении(Неопределено);
КонецПроцедуры

&НаСервере
Функция ПроверкаНаличияЧекЛистаПоОснованию()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваТестовыхОтвязов.Ссылка
		|ИЗ
		|	Документ.КСП_ЧекЛистПроверкиКачестваТестовыхОтвязов КАК ЧекЛистПроверкиКачестваТестовыхОтвязов
		|ГДЕ
		|	ЧекЛистПроверкиКачестваТестовыхОтвязов.ДокументОснование = &ДокументОснование
		|	И ЧекЛистПроверкиКачестваТестовыхОтвязов.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить("На основании документа " + Объект.ДокументОснование + " уже был создан " + ВыборкаДетальныеЗаписи.Ссылка + ". Необходимо работать в уже существующем документе", СтатусСообщения.Важное);
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь; 
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Сообщить("Документ должен быть введен на основании чек листа проверки качества пряжи", СтатусСообщения.Важное);
		Отказ = Истина;
	Иначе
		Отказ = ПроверкаНаличияЧекЛистаПоОснованию();
	КонецЕсли;
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Объект.ПлановаяДатаЗавершенияПретензионнойРаботы = БюджетированиеКлиентСервер.ДобавитьДень(Объект.ДатаПоступления, 15);
	КонецЕсли;  
	Элементы.ПредпросмотрФайла.Видимость = Элементы.ТехХарактеристикиПредварительныйПросмотр.Пометка;
	ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваТестовыхОтвязов = Константы.КСП_ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваТестовыхОтвязов.Получить();
	ПутьКПапкеТХПоПряже = Константы.КСП_ПутьКПапкеТХПоПряже.Получить(); 
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаОснованииНаСервере(Основание)
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.ЧекЛистПроверкиКачестваТестовыхОтвязов"));
	ДокументОбъект.Заполнить(Основание);
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)
	Ответ = Вопрос("Заполнить документ на основании документа " + Объект.ДокументОснование + "?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	Если Объект.ДокументОснование.Пустая() Тогда
		Сообщить("Сначала необходимо выбрать документ основание", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	ЗаполнитьНаОснованииНаСервере(Объект.ДокументОснование);
	ТоварыПриАктивизацииСтроки(Неопределено);
	Изображение = "";
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	СтрокаТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	Элементы.КонтрольКачества.ТолькоПросмотр = СтрокаТекущиеДанные.ПроверкаЗавершена;
	Элементы.ФотоДефектов.ТолькоПросмотр = СтрокаТекущиеДанные.ПроверкаЗавершена;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	СтрокаТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	КлючСтроки = СтрокаТекущиеДанные.КлючСтроки;
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", КлючСтроки);
	Элементы.КонтрольКачества.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Ответ = Вопрос("Данные документа будует перезаполнены. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	Если ПроверкаНаличияЧекЛистаПоОснованию() Тогда
		Объект.ДокументОснование = "";
	КонецЕсли;
	ЗаполнитьНаОснованииНаСервере(Объект.ДокументОснование);
КонецПроцедуры

&НаСервере
Процедура УдалитьФотоПоКлючу(КлючСтроки)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваПряжиФотоДефектов.ПутьКФайлу,
		|	ЧекЛистПроверкиКачестваПряжиФотоДефектов.КлючСтроки
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ФотоДефектов КАК ЧекЛистПроверкиКачестваПряжиФотоДефектов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ПутьКФайлу,
		|	ВТ.КлючСтроки
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.КлючСтроки <> &КлючСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ";
	
	Запрос.УстановитьПараметр("КлючСтроки", КлючСтроки);
	Запрос.УстановитьПараметр("ФотоДефектов", Объект.ФотоДефектов.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.ФотоДефектов.Очистить();
	Объект.ФотоДефектов.Загрузить(РезультатЗапроса.Выгрузить());
	Изображение = "";
КонецПроцедуры

&НаКлиенте
Процедура КонтрольКачестваПриАктивизацииСтроки(Элемент)
	СтрокаТекущиеДанные = Элементы.КонтрольКачества.ТекущиеДанные;
	Если СтрокаТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	Изображение = "";
	КлючСтроки = СтрокаТекущиеДанные.КлючСтрокиДляСвязиСФото;
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтрокиДляСвязиСФото", КлючСтроки);
	Элементы.ФотоДефектов.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
КонецПроцедуры

&НаКлиенте
Процедура КонтрольКачестваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Сообщить("Заполните таблицу ""Товары"" слева через функционал заполнения на основании", СтатусСообщения.Внимание);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрольКачестваПередНачаломИзменения(Элемент, Отказ)
	Если Элемент.Имя = "КонтрольКачестваПунктПроверки" Тогда
		СтрокаТекущиеДанные = Элементы.КонтрольКачества.ТекущиеДанные;
		Отказ = СтрокаТекущиеДанные.ПунктПроверки.АвтоматическиВключатьВЧекЛисты;
		Если Отказ Тогда
			Сообщить("Этот пункт чек листа изменять нельзя", СтатусСообщения.Внимание);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрольКачестваПередУдалением(Элемент, Отказ)
	СтрокаТекущиеДанные = Элементы.КонтрольКачества.ТекущиеДанные;
	Отказ = СтрокаТекущиеДанные.ПунктПроверки.АвтоматическиВключатьВЧекЛисты;
	Если Отказ Тогда
		Сообщить("Этот пункт чек листа удалять нельзя", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	КлючСтроки = СтрокаТекущиеДанные.КлючСтрокиДляСвязиСФото;
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки", КлючСтроки);
	ФотоДефектов = Объект.ФотоДефектов.НайтиСтроки(Отбор);
	Если ФотоДефектов.Количество() > 0 Тогда
		Ответ = Вопрос("По этому пункту чек листа существуют фото дефектов. При установке признака они будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
			Возврат;
		Иначе
			УдалитьФотоПоКлючу(КлючСтроки);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИзображение(ПутьКФайлу, Файл)
	Попытка
		Если ЗначениеЗаполнено(ПутьКФайлу) Тогда
			Изображение = ПоместитьВоВременноеХранилище(Новый Картинка(Файл), УникальныйИдентификатор);
		Иначе
			Изображение = ПоместитьВоВременноеХранилище(Новый Картинка, УникальныйИдентификатор);
		КонецЕсли;	
	Исключение
		Сообщить("Файл не найден. Возможно он был перемещен или удален", СтатусСообщения.Внимание);
	КонецПопытки;	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольКачестваПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	СтрокаТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Сообщить("Необходимо выбрать конкретную строку с номенклатурой в таблице слева", СтатусСообщения.Внимание);
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	ТекущиеДанные = Элементы.КонтрольКачества.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.КлючСтроки) или НоваяСтрока Тогда
		ТекущиеДанные.КлючСтроки = СтрокаТекущиеДанные.КлючСтроки;  	
		ТекущиеДанные.КлючСтрокиДляСвязиСФото = Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФотоДефектовПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.ФотоДефектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Файл = ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваТестовыхОтвязов + СтрЗаменить(ТекущиеДанные.ПутьКФайлу, ".\\", "\");
	ПоказатьИзображение(ТекущиеДанные.ПутьКФайлу, Файл);
КонецПроцедуры

&НаКлиенте
Процедура ФотоДефектовПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ФотоДефектовПутьКФайлуПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ФотоДефектовПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТекущиеДанные = Элементы.КонтрольКачества.ТекущиеДанные;
	Если СтрокаТекущиеДанные = Неопределено Тогда
		Сообщить("Необходимо выбрать конкретную строку в таблице контроля качества", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ФотоДефектов.ТекущиеДанные;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПредварительныйПросмотр = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл изображения дефекта";
	ДиалогОткрытияФайла.Каталог = ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваТестовыхОтвязов;
	ДиалогОткрытияФайла.Фильтр = 
		"Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.wmf;*.emf|" 
		+ "Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
		+ "Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
		+ "Формат TIFF (*.tif)|*.tif|"
		+ "Формат GIF (*.gif)|*.gif|"
		+ "Формат PNG (*.png)|*.png|"
		+ "Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf|"; // картинки

	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Каталог = РаботаСФайламиКлиент.СоздатьИлиНайтиКаталог(ПутьКПапкеИзображенийПоЧекЛистамПроверкиКачестваТестовыхОтвязов);	 
		Если Каталог=неопределено тогда
			Возврат;
		Конецесли;
		Файл=ДиалогОткрытияФайла.ПолноеИмяФайла ;
		ТекущиеДанные.ПутьКФайлу = ".\" + Прав(Файл, СтрДлина(Файл) - СтрДлина(Каталог));
		ТекущиеДанные.КлючСтроки = СтрокаТекущиеДанные.КлючСтроки;
		ТекущиеДанные.КлючСтрокиДляСвязиСФото = СтрокаТекущиеДанные.КлючСтрокиДляСвязиСФото;
		ПоказатьИзображение(ТекущиеДанные.ПутьКФайлу, Файл);
		КонтрольКачестваПриАктивизацииСтроки(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФотоДефектовПутьКФайлуПриИзменении(Элемент)
	ФотоДефектовПриАктивизацииСтроки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОтклонение()
	СтрокаТекущиеДанные = Элементы.КонтрольКачества.ТекущиеДанные;
	
	Если СтрокаТекущиеДанные = Неопределено
			ИЛИ ТипЗнч(СтрокаТекущиеДанные.Норматив) <> Тип("Число")
			или ТипЗнч(СтрокаТекущиеДанные.Факт) <> Тип("Число") Тогда
			
		Возврат;
		
	КонецЕсли;
	
	Если СтрокаТекущиеДанные.Факт = 0 Тогда
		
		СтрокаТекущиеДанные.Отклонение = 0;
		
	Иначе
		
		СтрокаТекущиеДанные.Отклонение = (СтрокаТекущиеДанные.Факт - СтрокаТекущиеДанные.Норматив) * 100 / СтрокаТекущиеДанные.Факт;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольКачестваНормативПриИзменении(Элемент)
	РассчитатьОтклонение();
КонецПроцедуры

&НаКлиенте
Процедура КонтрольКачестваФактПриИзменении(Элемент)
	РассчитатьОтклонение();
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудникаПоТекущемуПользователю()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиОрганизаций.Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК СотрудникиОрганизаций
		|ГДЕ
		|	СотрудникиОрганизаций.ФизическоеЛицо = &Физлицо
		|	И СотрудникиОрганизаций.ПометкаУдаления = ЛОЖЬ
		|	И СотрудникиОрганизаций.ГоловнаяОрганизация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Физлицо", ПараметрыСеанса.ТекущийПользователь.ФизическоеЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.СотрудникиОрганизаций.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.Проверил) Тогда
		Объект.Проверил = ПолучитьСотрудникаПоТекущемуПользователю();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрольКачестваПунктПроверкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтрокаТекущиеДанные = Элементы.КонтрольКачества.ТекущиеДанные;
	Если ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(СтрокаТекущиеДанные.ПунктПроверки,"АвтоматическиВключатьВЧекЛисты") Тогда
		Сообщить("Этот пункт проверки был включен в чек лист автоматически. Удалению и изменению не подлежит", СтатусСообщения.Внимание);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПлановаяДатаЗавершенияПретензионнойРаботыПриИзменении(Элемент)
	Если Объект.ПлановаяДатаЗавершенияПретензионнойРаботы < Объект.ДатаПоступления Тогда
		Сообщить("Плановая дата завершения претензионной работы не может быть меньше даты поступления", СтатусСообщения.Внимание);
		Объект.ПлановаяДатаЗавершенияПретензионнойРаботы = БюджетированиеКлиентСервер.ДобавитьДень(Объект.ДатаПоступления, 15);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаВыполненияЧекЛиста(КлючСтроки)
	ЧекЛистВыполнен = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовКонтрольКачества.ПунктПроверки,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовКонтрольКачества.Факт,
		|	ЧекЛистПроверкиКачестваТестовыхОтвязовКонтрольКачества.КлючСтроки
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&КонтрольКачества КАК ЧекЛистПроверкиКачестваТестовыхОтвязовКонтрольКачества
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ПунктПроверки
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.КлючСтроки = &КлючСтроки
		|	И ВТ.Факт = НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ";
	
	Запрос.УстановитьПараметр("КлючСтроки", КлючСтроки);
	Запрос.УстановитьПараметр("КонтрольКачества", Объект.КонтрольКачества.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЧекЛистВыполнен = Ложь;
		Сообщить("Пункт проверки " + ВыборкаДетальныеЗаписи.ПунктПроверки + " не был выполнен. Установка признака завершения проверки невозможна.", СтатусСообщения.Внимание);
	КонецЦикла;
	
	Возврат ЧекЛистВыполнен;
КонецФункции

&НаКлиенте
Процедура ТоварыПроверкаЗавершенаПриИзменении(Элемент)
	СтрокаТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	Если СтрокаТекущиеДанные.ПроверкаЗавершена Тогда
		Если Не ПроверкаВыполненияЧекЛиста(СтрокаТекущиеДанные.КлючСтроки) Тогда
			СтрокаТекущиеДанные.ПроверкаЗавершена = Ложь;
			Возврат;
		КонецЕсли;
		СтрокаТекущиеДанные.ДатаЗавершенияПроверки = ТекущаяДата();
	Иначе
		СтрокаТекущиеДанные.ДатаЗавершенияПроверки = "";
	КонецЕсли;
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Function ExcelToPDF(file) //file - полный путь файла .xls созданный средствами 1с
	
	Попытка
        Excel =  new  COMObject("Excel.Application");
    Исключение
        Сообщить("Не удалось преобразовать в pdf!!!");
        file="";
    КонецПопытки;
    Попытка  
        Excel.Workbooks.Open(file);
        Excel.ActiveSheet.PageSetup.zoom=false; //уместим на одной странице в ширину
        Excel.ActiveSheet.PageSetup.FitToPagesWide = 1; //уместим на одной странице в ширину
        Excel.ActiveSheet.PageSetup.FitToPagesTall = 10; //и на 10 в длину        
		ТекущиеДанные = Элементы.ТехХарактеристики.ТекущиеДанные;
		ВремФайл = КаталогВременныхФайлов() + СтрЗаменить(ТекущиеДанные.ПутьКФайлу, ".\\", "");
		file=лев(ВремФайл,стрдлина(ВремФайл)-4)+".pdf"; //подменяем раширение
		Excel.ActiveWorkbook.ExportAsFixedFormat(0, File,0,false,false,,,false,); //сохраняем в pdf 
        //0-pdf, file-полный путь файла, 0 - стандартное качество
        Excel.Quit(); // закрываем Excel
    Исключение
        Excel.Quit();
        Сообщить("Не удалось преобразовать в pdf!!!");
        file="";
	КонецПопытки;
	
    возврат file;
	
EndFunction

&НаКлиенте
Function WordToPDF(file) //file - полный путь файла .xls созданный средствами 1с
	
	Попытка
		Word = Новый COMОбъект("Word.Application");
		Document = Word.Documents.Open(file);
		file = ПолучитьИмяВременногоФайла("PDF");
		Document.SaveAs(file,17);
		Word.Quit();
	Исключение
		Word.Quit();
		Сообщить(ОписаниеОшибки());
		Сообщить("Не удалось преобразовать в pdf!!!");
		file="";
	КонецПопытки;
	
	Возврат file; 	
EndFunction

&НаКлиенте
Процедура РазместитьФайлВПолеHTML(ФайлыТекСтрока)	
	Если ФайлыТекСтрока=неопределено тогда
		ПредпросмотрФайла="";
		Возврат;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ФайлыТекСтрока.ПутьКФайлу) тогда
		ПредпросмотрФайла="";
		Возврат;
	КонецЕсли;	
	ИмяВременногоФайла = ПутьКПапкеТХПоПряже + СтрЗаменить(ФайлыТекСтрока.ПутьКФайлу, ".\\", "\"); 	
	Ф = Новый Файл(ИмяВременногоФайла);	
	Если Найти("*.xls;*.xlsx", НРег(Ф.Расширение)) > 0 Тогда		
		Если  ложь тогда //windows7 гавно
			ПредпросмотрФайла="";
		Иначе
			ВременныйФайл = ExcelToPDF(ИмяВременногоФайла);
			ПредпросмотрФайла=ВременныйФайл;			
		КонецЕсли;		
	ИначеЕсли Найти("*.doc;*.docx", НРег(Ф.Расширение)) > 0 Тогда		
		Если  ложь тогда //windows7 гавно
			ПредпросмотрФайла="";
		Иначе			
			ВременныйФайл = WordToPDF(ИмяВременногоФайла);
			ПредпросмотрФайла=ВременныйФайл;			
		КОнецЕсли;		
	ИначеЕсли Найти("*.asf;*.wma;*.wmv;*.avi;*.wav;*.mpeg;*.mp3;*.midi;*.aiff;*.au;*.flac;*.ogg", НРег(Ф.Расширение)) > 0 и ЛОЖЬ Тогда
		Текст_ТабличныйДокументКартинка = "<HTML><BODY>
		|<OBJECT id=WMP classid='CLSID:22D6f312-B0F6-11D0-94AB-0080C74C7E95' width='100%' height='100%'> 
		|</OBJECT></BODY></HTML>";		
		ПредпросмотрФайла=Текст_ТабличныйДокументКартинка;
	ИначеЕсли Найти("*.pdf", НРег(Ф.Расширение)) > 0 Тогда
		ПредпросмотрФайла=ИмяВременногоФайла;
	Иначе                         		
		ПредпросмотрФайла = "<HTML><BODY>Откройте файл вручную с помощью кнопки ""Открыть"" на командной панели табличной части ""Тех. характеристики от поставщика""</BODY></HTML>";		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТехХарактеристикиПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТекущиеДанные = Неопределено Тогда
		Сообщить("Необходимо выбрать конкретную строку в таблице ""Товары""", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ТехХарактеристики.ТекущиеДанные;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПредварительныйПросмотр = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл технических характеристик";
	ДиалогОткрытияФайла.Каталог = ПутьКПапкеТХПоПряже;
	ДиалогОткрытияФайла.Фильтр = РаботаСФайламиКлиент.ПолучитьФильтрФайлов();		

	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Каталог = РаботаСФайламиКлиент.СоздатьИлиНайтиКаталог(ПутьКПапкеТХПоПряже);	 
		Если Каталог=неопределено тогда
			Возврат;
		Конецесли;
		Файл=ДиалогОткрытияФайла.ПолноеИмяФайла ;
		ТекущиеДанные.ПутьКФайлу = ".\" + Прав(Файл, СтрДлина(Файл) - СтрДлина(Каталог));
		ТекущиеДанные.КлючСтроки = СтрокаТекущиеДанные.КлючСтроки;
		РазместитьФайлВПолеHTML(ТекущиеДанные)
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТехХарактеристикиПутьКФайлуПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТехХарактеристики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не Элементы.ТехХарактеристикиПредварительныйПросмотр.Пометка Тогда		
		Возврат;
	КонецЕсли;
	РазместитьФайлВПолеHTML(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТехХарактеристикиПриАктивизацииСтроки(Элемент)
	ТехХарактеристикиПутьКФайлуПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ТехХарактеристикиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТехХарактеристикиПутьКФайлуПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПредпросмотрФайлаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	ОткрытьФайл(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	ТекущиеДанные = Элементы.ТехХарактеристики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ПутьКФайлу) Тогда
		Возврат;
	КонецЕсли;
	ЗапуститьПриложение(ПутьКПапкеТХПоПряже + СтрЗаменить(ТекущиеДанные.ПутьКФайлу, ".\\", "\"));
КонецПроцедуры    
// СтандартныеПодсистемы.Печать 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.Печать 
// СтандартныеПодсистемы.ПодключаемыеКоманды 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект); 
КонецПроцедуры 
&НаСервере 
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат); 
КонецПроцедуры 
&НаКлиенте 
Процедура Подключаемый_ОбновитьКоманды() 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
